#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.example: Reading...
aws_ecr_repository.dashboard: Refreshing state... [id=c18-climate-monitor-dashboard-ecr]
aws_ecr_repository.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-ecr]
aws_ecr_repository.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-ecr]
aws_ecr_repository.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_ecr_repository.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-ecr]
aws_iam_role.orchestrator_lambda: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam]
aws_security_group.allow_5432: Refreshing state... [id=sg-00146638977b9f8dc]
aws_cloudwatch_log_group.historic_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-weather-lambda]
aws_ecr_repository.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-ecr]
data.aws_iam_policy_document.example: Read complete after 0s [id=1734155287]
aws_ecr_repository.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-ecr]
aws_cloudwatch_log_group.live_flood_warnings: Refreshing state... [id=/aws/lambda/c18-climate-monitor-live-flood-warnings-lambda]
aws_ecr_repository.future_predictions: Refreshing state... [id=c18-climate-monitor-future-predictions-ecr]
aws_iam_role.lambda: Refreshing state... [id=c18-climate-monitor-lambda-iam]
aws_cloudwatch_log_group.future_climate: Refreshing state... [id=/aws/lambda/c18-climate-monitor-future-predictions-lambda]
aws_cloudwatch_log_group.current_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-air-quality-lambda]
aws_ecr_repository.flood_warning_check: Refreshing state... [id=c18-climate-monitor-flood-warning-check-ecr]
aws_ecr_repository.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-ecr]
aws_ecr_repository.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-ecr]
aws_cloudwatch_log_group.location_assignment: Refreshing state... [id=/aws/lambda/c18-climate-monitor-location-assignment-lambda]
aws_cloudwatch_log_group.current_weather: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-weather-lambda]
aws_cloudwatch_log_group.current_reading_orchestrator: Refreshing state... [id=/aws/lambda/c18-climate-monitor-current-reading-orchestrator-lambda]
aws_cloudwatch_log_group.historic_air_quality: Refreshing state... [id=/aws/lambda/c18-climate-monitor-historic-air-quality-lambda]
aws_iam_role_policy.invoke_lambdas: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam:invoke-other-lambdas]
aws_iam_role_policy_attachment.orchestrator_lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-orchestrator-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_db_instance.climate: Refreshing state... [id=db-FRWD4BKFF4THTAGHZDARGIT56U]
aws_vpc_security_group_ingress_rule.allow_ingress_5432: Refreshing state... [id=sgr-0c0647e7620fc928e]
aws_ecr_repository_policy.example: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_iam_role_policy_attachment.lambda_basic_exec_role: Refreshing state... [id=c18-climate-monitor-lambda-iam/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_lambda_function.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-lambda]
aws_lambda_function.location_assignment: Refreshing state... [id=c18-climate-monitor-location-assignment-lambda]
aws_lambda_function.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-lambda]
aws_lambda_function.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-lambda]
aws_lambda_function.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-lambda]
aws_lambda_function.future_climate: Refreshing state... [id=c18-climate-monitor-future-predictions-lambda]
aws_lambda_function.live_flood_warnings: Refreshing state... [id=c18-climate-monitor-live-flood-warnings-lambda]
aws_lambda_function.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-lambda]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.lambda_scheduler will be created
  + resource "aws_iam_role" "lambda_scheduler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "scheduler.amazonaws.com",
                            ]
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "c18-climate-monitor-scheduler-iam"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.pipeline_scheduler will be created
  + resource "aws_iam_role_policy" "pipeline_scheduler" {
      + id          = (known after apply)
      + name        = "c18-climate-monitor-scheduler-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_scheduler_schedule.live_flood_warnings_scheduler will be created
  + resource "aws_scheduler_schedule" "live_flood_warnings_scheduler" {
      + arn                          = (known after apply)
      + group_name                   = (known after apply)
      + id                           = (known after apply)
      + name                         = "c18-climate-monitor-live-flood-warnings-scheduler"
      + name_prefix                  = (known after apply)
      + region                       = "eu-west-2"
      + schedule_expression          = "cron(*/15 * * * ? *)"
      + schedule_expression_timezone = "Europe/London"
      + state                        = "ENABLED"

      + flexible_time_window {
          + mode = "OFF"
        }

      + target {
          + arn      = "arn:aws:lambda:eu-west-2:129033205317:function:c18-climate-monitor-live-flood-warnings-lambda"
          + role_arn = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @mattsnowdon1, Action: `pull_request`*